In [1]:
import pandas as pd
import sqlite3


# create a dataframe to import data for the tutorial
df= pd.DataFrame({'name': ['Juan', 'Victoria', 'Mary'], 
                  'age': [23,34,43], 
                  'city': ['Miami', 'Buenos Aires','Santiago']})
df

       name  age          city
0      Juan   23         Miami
1  Victoria   34  Buenos Aires
2      Mary   43      Santiago

In [2]:
# We will sqlite3 library and create a connection
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [4]:
df.to_sql('people_1', cnn)

3

In [5]:
%load_ext sql

In [6]:
%sql sqlite:///jupyter_sql_tutorial.db

Connecting to 'sqlite:///jupyter_sql_tutorial.db'

In [7]:
%%sql
SELECT
  *
FROM
  people

Running query in 'sqlite:///jupyter_sql_tutorial.db'

+-------+----------+-----+--------------+
| index |   name   | age |     city     |
+-------+----------+-----+--------------+
|   0   |   Juan   |  23 |    Miami     |
|   1   | Victoria |  34 | Buenos Aires |
|   2   |   Mary   |  43 |   Santiago   |
+-------+----------+-----+--------------+

In [8]:
%%sql
SELECT
  COUNT(*)
FROM
  people

Running query in 'sqlite:///jupyter_sql_tutorial.db'

+----------+
| COUNT(*) |
+----------+
|    3     |
+----------+

In [9]:
%%sql
SELECT
  SUM(age) AS 'age_sum'
FROM
  people

Running query in 'sqlite:///jupyter_sql_tutorial.db'

+---------+
| age_sum |
+---------+
|   100   |
+---------+